zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K341_EMIOS.h
/*! @name GFLAG - Global Flag */
/*! @{ */

#define eMIOS_GFLAG_F0_MASK                      (0x1U)
#define eMIOS_GFLAG_F0_SHIFT                     (0U)
#define eMIOS_GFLAG_F0_WIDTH                     (1U)
#define eMIOS_GFLAG_F0(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F0_SHIFT)) & eMIOS_GFLAG_F0_MASK)

#define eMIOS_GFLAG_F1_MASK                      (0x2U)
#define eMIOS_GFLAG_F1_SHIFT                     (1U)
#define eMIOS_GFLAG_F1_WIDTH                     (1U)
#define eMIOS_GFLAG_F1(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F1_SHIFT)) & eMIOS_GFLAG_F1_MASK)

#define eMIOS_GFLAG_F2_MASK                      (0x4U)
#define eMIOS_GFLAG_F2_SHIFT                     (2U)
#define eMIOS_GFLAG_F2_WIDTH                     (1U)
#define eMIOS_GFLAG_F2(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F2_SHIFT)) & eMIOS_GFLAG_F2_MASK)

#define eMIOS_GFLAG_F3_MASK                      (0x8U)
#define eMIOS_GFLAG_F3_SHIFT                     (3U)
#define eMIOS_GFLAG_F3_WIDTH                     (1U)
#define eMIOS_GFLAG_F3(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F3_SHIFT)) & eMIOS_GFLAG_F3_MASK)

#define eMIOS_GFLAG_F4_MASK                      (0x10U)
#define eMIOS_GFLAG_F4_SHIFT                     (4U)
#define eMIOS_GFLAG_F4_WIDTH                     (1U)
#define eMIOS_GFLAG_F4(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F4_SHIFT)) & eMIOS_GFLAG_F4_MASK)

#define eMIOS_GFLAG_F5_MASK                      (0x20U)
#define eMIOS_GFLAG_F5_SHIFT                     (5U)
#define eMIOS_GFLAG_F5_WIDTH                     (1U)
#define eMIOS_GFLAG_F5(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F5_SHIFT)) & eMIOS_GFLAG_F5_MASK)

#define eMIOS_GFLAG_F6_MASK                      (0x40U)
#define eMIOS_GFLAG_F6_SHIFT                     (6U)
#define eMIOS_GFLAG_F6_WIDTH                     (1U)
#define eMIOS_GFLAG_F6(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F6_SHIFT)) & eMIOS_GFLAG_F6_MASK)

#define eMIOS_GFLAG_F7_MASK                      (0x80U)
#define eMIOS_GFLAG_F7_SHIFT                     (7U)
#define eMIOS_GFLAG_F7_WIDTH                     (1U)
#define eMIOS_GFLAG_F7(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F7_SHIFT)) & eMIOS_GFLAG_F7_MASK)

#define eMIOS_GFLAG_F8_MASK                      (0x100U)
#define eMIOS_GFLAG_F8_SHIFT                     (8U)
#define eMIOS_GFLAG_F8_WIDTH                     (1U)
#define eMIOS_GFLAG_F8(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F8_SHIFT)) & eMIOS_GFLAG_F8_MASK)

#define eMIOS_GFLAG_F9_MASK                      (0x200U)
#define eMIOS_GFLAG_F9_SHIFT                     (9U)
#define eMIOS_GFLAG_F9_WIDTH                     (1U)
#define eMIOS_GFLAG_F9(x)                        (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F9_SHIFT)) & eMIOS_GFLAG_F9_MASK)

#define eMIOS_GFLAG_F10_MASK                     (0x400U)
#define eMIOS_GFLAG_F10_SHIFT                    (10U)
#define eMIOS_GFLAG_F10_WIDTH                    (1U)
#define eMIOS_GFLAG_F10(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F10_SHIFT)) & eMIOS_GFLAG_F10_MASK)

#define eMIOS_GFLAG_F11_MASK                     (0x800U)
#define eMIOS_GFLAG_F11_SHIFT                    (11U)
#define eMIOS_GFLAG_F11_WIDTH                    (1U)
#define eMIOS_GFLAG_F11(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F11_SHIFT)) & eMIOS_GFLAG_F11_MASK)

#define eMIOS_GFLAG_F12_MASK                     (0x1000U)
#define eMIOS_GFLAG_F12_SHIFT                    (12U)
#define eMIOS_GFLAG_F12_WIDTH                    (1U)
#define eMIOS_GFLAG_F12(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F12_SHIFT)) & eMIOS_GFLAG_F12_MASK)

#define eMIOS_GFLAG_F13_MASK                     (0x2000U)
#define eMIOS_GFLAG_F13_SHIFT                    (13U)
#define eMIOS_GFLAG_F13_WIDTH                    (1U)
#define eMIOS_GFLAG_F13(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F13_SHIFT)) & eMIOS_GFLAG_F13_MASK)

#define eMIOS_GFLAG_F14_MASK                     (0x4000U)
#define eMIOS_GFLAG_F14_SHIFT                    (14U)
#define eMIOS_GFLAG_F14_WIDTH                    (1U)
#define eMIOS_GFLAG_F14(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F14_SHIFT)) & eMIOS_GFLAG_F14_MASK)

#define eMIOS_GFLAG_F15_MASK                     (0x8000U)
#define eMIOS_GFLAG_F15_SHIFT                    (15U)
#define eMIOS_GFLAG_F15_WIDTH                    (1U)
#define eMIOS_GFLAG_F15(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F15_SHIFT)) & eMIOS_GFLAG_F15_MASK)

#define eMIOS_GFLAG_F16_MASK                     (0x10000U)
#define eMIOS_GFLAG_F16_SHIFT                    (16U)
#define eMIOS_GFLAG_F16_WIDTH                    (1U)
#define eMIOS_GFLAG_F16(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F16_SHIFT)) & eMIOS_GFLAG_F16_MASK)

#define eMIOS_GFLAG_F17_MASK                     (0x20000U)
#define eMIOS_GFLAG_F17_SHIFT                    (17U)
#define eMIOS_GFLAG_F17_WIDTH                    (1U)
#define eMIOS_GFLAG_F17(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F17_SHIFT)) & eMIOS_GFLAG_F17_MASK)

#define eMIOS_GFLAG_F18_MASK                     (0x40000U)
#define eMIOS_GFLAG_F18_SHIFT                    (18U)
#define eMIOS_GFLAG_F18_WIDTH                    (1U)
#define eMIOS_GFLAG_F18(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F18_SHIFT)) & eMIOS_GFLAG_F18_MASK)

#define eMIOS_GFLAG_F19_MASK                     (0x80000U)
#define eMIOS_GFLAG_F19_SHIFT                    (19U)
#define eMIOS_GFLAG_F19_WIDTH                    (1U)
#define eMIOS_GFLAG_F19(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F19_SHIFT)) & eMIOS_GFLAG_F19_MASK)

#define eMIOS_GFLAG_F20_MASK                     (0x100000U)
#define eMIOS_GFLAG_F20_SHIFT                    (20U)
#define eMIOS_GFLAG_F20_WIDTH                    (1U)
#define eMIOS_GFLAG_F20(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F20_SHIFT)) & eMIOS_GFLAG_F20_MASK)

#define eMIOS_GFLAG_F21_MASK                     (0x200000U)
#define eMIOS_GFLAG_F21_SHIFT                    (21U)
#define eMIOS_GFLAG_F21_WIDTH                    (1U)
#define eMIOS_GFLAG_F21(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F21_SHIFT)) & eMIOS_GFLAG_F21_MASK)

#define eMIOS_GFLAG_F22_MASK                     (0x400000U)
#define eMIOS_GFLAG_F22_SHIFT                    (22U)
#define eMIOS_GFLAG_F22_WIDTH                    (1U)
#define eMIOS_GFLAG_F22(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F22_SHIFT)) & eMIOS_GFLAG_F22_MASK)

#define eMIOS_GFLAG_F23_MASK                     (0x800000U)
#define eMIOS_GFLAG_F23_SHIFT                    (23U)
#define eMIOS_GFLAG_F23_WIDTH                    (1U)
#define eMIOS_GFLAG_F23(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F23_SHIFT)) & eMIOS_GFLAG_F23_MASK)
/*! @} */

/*! @name OUDIS - Output Update Disable */
/*! @{ */

#define eMIOS_OUDIS_OU0_MASK                     (0x1U)
#define eMIOS_OUDIS_OU0_SHIFT                    (0U)
#define eMIOS_OUDIS_OU0_WIDTH                    (1U)
#define eMIOS_OUDIS_OU0(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU0_SHIFT)) & eMIOS_OUDIS_OU0_MASK)

#define eMIOS_OUDIS_OU1_MASK                     (0x2U)
#define eMIOS_OUDIS_OU1_SHIFT                    (1U)
#define eMIOS_OUDIS_OU1_WIDTH                    (1U)
#define eMIOS_OUDIS_OU1(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU1_SHIFT)) & eMIOS_OUDIS_OU1_MASK)

